xd3011/ESP32-Provisioner-BLE-Mesh/main/main.c
        // Publish the data via MQTT
        int msg_id = esp_mqtt_client_publish(
            get_mqtt_client(), "home_iot/gatewayScan", mqtt_message, 0, 0, 0);
        ESP_LOGI(TAG, "sent publish successful, msg_id=%d", msg_id);
        // -------------------------------
    }
    return;
}

static void mqtt_action_provision(uint8_t dev_uuid[16],
                                  uint8_t addr[BD_ADDR_LEN],
                                  esp_ble_mesh_addr_type_t addr_type,
                                  uint16_t oob_info,
                                  esp_ble_mesh_prov_bearer_t bearer) {
    esp_ble_mesh_unprov_dev_add_t add_dev = {0};
    int err;

    memcpy(add_dev.addr, addr, BD_ADDR_LEN);
    add_dev.addr_type = (esp_ble_mesh_addr_type_t)addr_type;
    memcpy(add_dev.uuid, dev_uuid, 16);
    add_dev.oob_info = oob_info;
    add_dev.bearer = (esp_ble_mesh_prov_bearer_t)bearer;
    /* Note: If unprovisioned device adv packets have not been received, we
       should not add device with ADD_DEV_START_PROV_NOW_FLAG set. */
    err = esp_ble_mesh_provisioner_add_unprov_dev(
        &add_dev, (esp_ble_mesh_dev_add_flag_t)(ADD_DEV_RM_AFTER_PROV_FLAG |
                                                ADD_DEV_START_PROV_NOW_FLAG |
                                                ADD_DEV_FLUSHABLE_DEV_FLAG));
    if (err) {
        ESP_LOGE(TAG, "%s: Add unprovisioned device into queue failed",
                 __func__);
    }
    return;
}

void example_ble_mesh_send_sensor_message(uint16_t addr, uint32_t opcode) {
    esp_ble_mesh_sensor_client_get_state_t get = {0};
    esp_ble_mesh_client_common_param_t common = {0};
    esp_ble_mesh_node_t *node = NULL;
    esp_err_t err = ESP_OK;

    node = esp_ble_mesh_provisioner_get_node_with_addr(addr);
    if (node == NULL) {
        ESP_LOGE(TAG, "Node 0x%04x not exists", addr);
        return;
    }

    example_ble_mesh_set_msg_common(&common, node, sensor_client.model, opcode);
    switch (opcode) {
        case ESP_BLE_MESH_MODEL_OP_SENSOR_CADENCE_GET:
            get.cadence_get.property_id = sensor_prop_id;
            break;
        case ESP_BLE_MESH_MODEL_OP_SENSOR_SETTINGS_GET:
            get.settings_get.sensor_property_id = sensor_prop_id;
            break;
        case ESP_BLE_MESH_MODEL_OP_SENSOR_SERIES_GET:
            get.series_get.property_id = sensor_prop_id;
            break;
        default:
            break;
    }

    err = esp_ble_mesh_sensor_client_get_state(&common, &get);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to send sensor message 0x%04" PRIx32, opcode);
    }
}

void send_reset_node(uint16_t addr) {
    esp_ble_mesh_cfg_client_set_state_t set_state = {0};
    esp_ble_mesh_client_common_param_t common = {0};
    esp_err_t err = ESP_OK;
    esp_ble_mesh_node_t *node =
        esp_ble_mesh_provisioner_get_node_with_addr(addr);
    example_ble_mesh_set_msg_common(&common, node, config_client.model,
                                    ESP_BLE_MESH_MODEL_OP_NODE_RESET);
    set_state.model_app_bind.element_addr = node->unicast_addr;
    set_state.model_app_bind.model_app_idx = prov_key.app_idx;

    if (strcmp(model_setup, "ONOFF") == 0 ||
        strcmp(model_setup, "SWITCH") == 0 ||
        strcmp(model_setup, "BUTTON") == 0) {
        set_state.model_app_bind.model_id = ESP_BLE_MESH_MODEL_ID_GEN_ONOFF_SRV;
    } else if (strcmp(model_setup, "SENSOR") == 0) {
        set_state.model_app_bind.model_id = ESP_BLE_MESH_MODEL_ID_SENSOR_SRV;

    } else {
        ESP_LOGE(TAG, "No valid model_id selected");
        return;
    }

    set_state.model_app_bind.company_id = ESP_BLE_MESH_CID_NVAL;
    err = esp_ble_mesh_config_client_set_state(&common, &set_state);
    if (err) {
        ESP_LOGE(TAG, "Send Node Reset failed");
        return;
    }
    esp_ble_mesh_provisioner_delete_node_with_addr(addr);
}

void send_to_cloud(double *values, int count, uint16_t unicast) {
    esp_ble_mesh_node_t *node =
        esp_ble_mesh_provisioner_get_node_with_addr(unicast);
    char addr_str[18];
    if (node) {
        sprintf(addr_str, "%02X:%02X:%02X:%02X:%02X:%02X", node->addr[0],
                node->addr[1], node->addr[2], node->addr[3], node->addr[4],
                node->addr[5]);
    }
    if (count == 2) {
        // DHT22 Sensor
        char mqtt_message[256];  // Tăng kích thước để chứa thêm dữ liệu
        snprintf(mqtt_message, sizeof(mqtt_message),
                 "{\"mac_address\":\"%s\", "
                 "\"data\":{\"temperature\":%.2f, "
                 "\"humidity\":%.2f}}",
                 addr_str, values[0], values[1]);
        int msg_id = esp_mqtt_client_publish(get_mqtt_client(), "home_iot/data",
                                             mqtt_message, 0, 0, 0);
        ESP_LOGI(TAG, "sent publish successful, msg_id=%d", msg_id);
    } else if (count == 1) {
        // Custom Sensor
    }
    return;
}

void send_heartbeat_node(esp_ble_mesh_node_t *node) {
    esp_ble_mesh_cfg_client_set_state_t set_state = {0};
    esp_ble_mesh_client_common_param_t common = {0};
    esp_err_t err = ESP_OK;
    example_ble_mesh_set_msg_common(&common, node, config_client.model,
                                    ESP_BLE_MESH_MODEL_OP_HEARTBEAT_PUB_SET);
    set_state.heartbeat_pub_set.dst = node->unicast_addr;
    set_state.heartbeat_pub_set.count = 4;
    set_state.heartbeat_pub_set.period = 5;
    set_state.heartbeat_pub_set.ttl = 7;
    set_state.heartbeat_pub_set.feature = 0x0001;
    set_state.heartbeat_pub_set.net_idx = prov_key.net_idx;
    err = esp_ble_mesh_config_client_set_state(&common, &set_state);
    if (err) {
        ESP_LOGE(TAG, "Send Node Hearbeat failed");
        return;
    }
}

void send_node_state_to_cloud(char *addr_str, uint16_t state) {
    char mqtt_message[128];
    snprintf(mqtt_message, sizeof(mqtt_message),
             "{\"mac_address\":\"%s\", \"state\":%d}", addr_str, state);
    int msg_id = esp_mqtt_client_publish(get_mqtt_client(), "home_iot/state",
                                         mqtt_message, 0, 0, 0);
    ESP_LOGI(TAG, "sent state successful, msg_id=%d", msg_id);
    return;
}

static void example_ble_mesh_provisioning_cb(
    esp_ble_mesh_prov_cb_event_t event, esp_ble_mesh_prov_cb_param_t *param) {
    switch (event) {
        case ESP_BLE_MESH_PROVISIONER_PROV_ENABLE_COMP_EVT:
            ESP_LOGI(
                TAG,
                "ESP_BLE_MESH_PROVISIONER_PROV_ENABLE_COMP_EVT, err_code %d",
                param->provisioner_prov_enable_comp.err_code);
            break;
        case ESP_BLE_MESH_PROVISIONER_PROV_DISABLE_COMP_EVT:
            ESP_LOGI(
                TAG,
                "ESP_BLE_MESH_PROVISIONER_PROV_DISABLE_COMP_EVT, err_code %d",
                param->provisioner_prov_disable_comp.err_code);
            break;
        case ESP_BLE_MESH_PROVISIONER_RECV_UNPROV_ADV_PKT_EVT:
            if (enable_provisioner == 1) {
                recv_unprov_adv_pkt(
                    param->provisioner_recv_unprov_adv_pkt.dev_uuid,
                    param->provisioner_recv_unprov_adv_pkt.addr,
                    param->provisioner_recv_unprov_adv_pkt.addr_type,
                    param->provisioner_recv_unprov_adv_pkt.oob_info,
                    param->provisioner_recv_unprov_adv_pkt.adv_type,
                    param->provisioner_recv_unprov_adv_pkt.bearer);
            }
            break;
        case ESP_BLE_MESH_PROVISIONER_PROV_LINK_OPEN_EVT:
            prov_link_open(param->provisioner_prov_link_open.bearer);
            break;
        case ESP_BLE_MESH_PROVISIONER_PROV_LINK_CLOSE_EVT:
            prov_link_close(param->provisioner_prov_link_close.bearer,
                            param->provisioner_prov_link_close.reason);
            break;
        case ESP_BLE_MESH_PROVISIONER_PROV_COMPLETE_EVT:
            esp_ble_mesh_node_t *node =
                esp_ble_mesh_provisioner_get_node_with_uuid(
                    param->provisioner_prov_complete.device_uuid);
            char addr_str[18];
            if (node) {
                sprintf(addr_str, "%02X:%02X:%02X:%02X:%02X:%02X",
                        node->addr[0], node->addr[1], node->addr[2],
                        node->addr[3], node->addr[4], node->addr[5]);
            }
            prov_complete(addr_str, param->provisioner_prov_complete.node_idx,
                          param->provisioner_prov_complete.device_uuid,
                          param->provisioner_prov_complete.unicast_addr,
                          param->provisioner_prov_complete.element_num,
                          param->provisioner_prov_complete.netkey_idx);
            break;
        case ESP_BLE_MESH_PROVISIONER_ADD_UNPROV_DEV_COMP_EVT:
            ESP_LOGI(
                TAG,
                "ESP_BLE_MESH_PROVISIONER_ADD_UNPROV_DEV_COMP_EVT, err_code %d",
                param->provisioner_add_unprov_dev_comp.err_code);
            break;
        case ESP_BLE_MESH_PROVISIONER_SET_DEV_UUID_MATCH_COMP_EVT:
            ESP_LOGI(TAG,
                     "ESP_BLE_MESH_PROVISIONER_SET_DEV_UUID_MATCH_COMP_EVT, "
                     "err_code %d",
                     param->provisioner_set_dev_uuid_match_comp.err_code);
            break;
        case ESP_BLE_MESH_PROVISIONER_SET_NODE_NAME_COMP_EVT: {
            ESP_LOGI(
                TAG,
                "ESP_BLE_MESH_PROVISIONER_SET_NODE_NAME_COMP_EVT, err_code %d",
                param->provisioner_set_node_name_comp.err_code);
            if (param->provisioner_set_node_name_comp.err_code == ESP_OK) {
                const char *name = NULL;
                name = esp_ble_mesh_provisioner_get_node_name(
                    param->provisioner_set_node_name_comp.node_index);
                if (!name) {
                    ESP_LOGE(TAG, "Get node name failed");
                    return;
                }
                ESP_LOGI(TAG, "Node %d name is: %s",
                         param->provisioner_set_node_name_comp.node_index,
                         name);
            }
            break;
        }
        case ESP_BLE_MESH_PROVISIONER_ADD_LOCAL_APP_KEY_COMP_EVT: {
            ESP_LOGI(TAG,
                     "ESP_BLE_MESH_PROVISIONER_ADD_LOCAL_APP_KEY_COMP_EVT, "
                     "err_code %d",
                     param->provisioner_add_app_key_comp.err_code);
            if (param->provisioner_add_app_key_comp.err_code == ESP_OK) {
                esp_err_t err = 0;
                prov_key.app_idx = param->provisioner_add_app_key_comp.app_idx;
                err = esp_ble_mesh_provisioner_bind_app_key_to_local_model(
                    PROV_OWN_ADDR, prov_key.app_idx,
                    ESP_BLE_MESH_MODEL_ID_GEN_ONOFF_CLI, ESP_BLE_MESH_CID_NVAL);
                if (err != ESP_OK) {
                    ESP_LOGE(TAG, "Provisioner bind local model appkey failed");
                    return;
                }
                err = esp_ble_mesh_provisioner_bind_app_key_to_local_model(
                    PROV_OWN_ADDR, prov_key.app_idx,
                    ESP_BLE_MESH_MODEL_ID_SENSOR_CLI, ESP_BLE_MESH_CID_NVAL);
                if (err != ESP_OK) {
                    ESP_LOGE(TAG,
                             "Provisioner bind app key to Sensor Client Model "
                             "failed");
                }
            }
            break;
        }
        case ESP_BLE_MESH_PROVISIONER_BIND_APP_KEY_TO_MODEL_COMP_EVT:
            ESP_LOGI(TAG,
                     "ESP_BLE_MESH_PROVISIONER_BIND_APP_KEY_TO_MODEL_COMP_EVT, "
                     "err_code %d",
                     param->provisioner_bind_app_key_to_model_comp.err_code);
            break;
        default:
            break;
    }

    return;
}

static void example_ble_mesh_config_client_cb(
    esp_ble_mesh_cfg_client_cb_event_t event,
    esp_ble_mesh_cfg_client_cb_param_t *param) {
    esp_ble_mesh_client_common_param_t common = {0};
    esp_ble_mesh_node_t *node = NULL;
    uint32_t opcode;
    uint16_t addr;
    int err;
    static uint16_t wait_model_id, wait_cid;

    opcode = param->params->opcode;
    addr = param->params->ctx.addr;

