xd3011/ESP32-Provisioner-BLE-Mesh/main/main.c
    ESP_LOGI(TAG,
             "%s, error_code = 0x%02x, event = 0x%02x, addr: 0x%04x, opcode: "
             "0x%04" PRIx32,
             __func__, param->error_code, event, param->params->ctx.addr,
             opcode);

    if (param->error_code) {
        ESP_LOGE(TAG, "Send config client message failed, opcode 0x%04" PRIx32,
                 opcode);
        return;
    }

    node = esp_ble_mesh_provisioner_get_node_with_addr(addr);
    if (!node) {
        if (opcode == ESP_BLE_MESH_MODEL_OP_NODE_RESET) {
            ESP_LOGI(TAG, "Node reset successfully");
            return;
        }
        ESP_LOGE(TAG, "%s: Get node info failed", __func__);
        return;
    }

    switch (event) {
        case ESP_BLE_MESH_CFG_CLIENT_GET_STATE_EVT:
            switch (opcode) {
                case ESP_BLE_MESH_MODEL_OP_COMPOSITION_DATA_GET: {
                    ESP_LOGI(TAG, "composition data %s",
                             bt_hex(param->status_cb.comp_data_status
                                        .composition_data->data,
                                    param->status_cb.comp_data_status
                                        .composition_data->len));
                    esp_ble_mesh_cfg_client_set_state_t set_state = {0};
                    example_ble_mesh_set_msg_common(
                        &common, node, config_client.model,
                        ESP_BLE_MESH_MODEL_OP_APP_KEY_ADD);
                    set_state.app_key_add.net_idx = prov_key.net_idx;
                    set_state.app_key_add.app_idx = prov_key.app_idx;
                    memcpy(set_state.app_key_add.app_key, prov_key.app_key, 16);
                    err = esp_ble_mesh_config_client_set_state(&common,
                                                               &set_state);
                    if (err) {
                        ESP_LOGE(TAG, "%s: Config AppKey Add failed", __func__);
                        return;
                    }
                    break;
                }
                default:
                    break;
            }
            break;
        case ESP_BLE_MESH_CFG_CLIENT_SET_STATE_EVT:
            switch (opcode) {
                case ESP_BLE_MESH_MODEL_OP_APP_KEY_ADD: {
                    esp_ble_mesh_cfg_client_set_state_t set_state = {0};
                    example_ble_mesh_set_msg_common(
                        &common, node, config_client.model,
                        ESP_BLE_MESH_MODEL_OP_MODEL_APP_BIND);
                    set_state.model_app_bind.element_addr = node->unicast_addr;
                    set_state.model_app_bind.model_app_idx = prov_key.app_idx;

                    if (strcmp(model_setup, "ONOFF") == 0 ||
                        strcmp(model_setup, "SWITCH") == 0 ||
                        strcmp(model_setup, "BUTTON") == 0) {
                        set_state.model_app_bind.model_id =
                            ESP_BLE_MESH_MODEL_ID_GEN_ONOFF_SRV;
                    } else if (strcmp(model_setup, "SENSOR") == 0) {
                        set_state.model_app_bind.model_id =
                            ESP_BLE_MESH_MODEL_ID_SENSOR_SRV;
                    } else {
                        ESP_LOGE(TAG, "No valid model_id selected");
                        return;
                    }

                    set_state.model_app_bind.company_id = ESP_BLE_MESH_CID_NVAL;
                    err = esp_ble_mesh_config_client_set_state(&common,
                                                               &set_state);
                    if (err) {
                        ESP_LOGE(TAG, "%s: Config Model App Bind failed",
                                 __func__);
                        return;
                    }
                    break;
                }
                case ESP_BLE_MESH_MODEL_OP_MODEL_APP_BIND: {
                    if (param->status_cb.model_app_status.model_id ==
                            ESP_BLE_MESH_MODEL_ID_SENSOR_SRV &&
                        param->status_cb.model_app_status.company_id ==
                            ESP_BLE_MESH_CID_NVAL) {
                        esp_ble_mesh_cfg_client_set_state_t set_state = {0};
                        example_ble_mesh_set_msg_common(
                            &common, node, config_client.model,
                            ESP_BLE_MESH_MODEL_OP_MODEL_APP_BIND);
                        set_state.model_app_bind.element_addr =
                            node->unicast_addr;
                        set_state.model_app_bind.model_app_idx =
                            prov_key.app_idx;
                        set_state.model_app_bind.model_id =
                            ESP_BLE_MESH_MODEL_ID_SENSOR_SETUP_SRV;
                        set_state.model_app_bind.company_id =
                            ESP_BLE_MESH_CID_NVAL;
                        err = esp_ble_mesh_config_client_set_state(&common,
                                                                   &set_state);
                        if (err != ESP_OK) {
                            ESP_LOGE(TAG,
                                     "Failed to send Config Model App Bind");
                            return;
                        }
                        wait_model_id = ESP_BLE_MESH_MODEL_ID_SENSOR_SETUP_SRV;
                        wait_cid = ESP_BLE_MESH_CID_NVAL;
                    } else if (param->status_cb.model_app_status.model_id ==
                                   ESP_BLE_MESH_MODEL_ID_SENSOR_SETUP_SRV &&
                               param->status_cb.model_app_status.company_id ==
                                   ESP_BLE_MESH_CID_NVAL) {
                        ESP_LOGW(TAG, "Provision and config successfully");
                    } else if (param->status_cb.model_app_status.model_id ==
                                   ESP_BLE_MESH_MODEL_ID_GEN_ONOFF_SRV &&
                               param->status_cb.model_app_status.company_id ==
                                   ESP_BLE_MESH_CID_NVAL) {
                        esp_ble_mesh_generic_client_get_state_t get_state = {0};
                        example_ble_mesh_set_msg_common(
                            &common, node, onoff_client.model,
                            ESP_BLE_MESH_MODEL_OP_GEN_ONOFF_GET);
                        err = esp_ble_mesh_generic_client_get_state(&common,
                                                                    &get_state);
                        if (err) {
                            ESP_LOGE(TAG, "%s: Generic OnOff Get failed",
                                     __func__);
                            return;
                        }
                    }
                    break;
                }
                case ESP_BLE_MESH_MODEL_OP_NODE_RESET:
                    ESP_LOGI(TAG, "Node reset successfully");
                    break;
                case ESP_BLE_MESH_MODEL_OP_HEARTBEAT_PUB_SET: {
                    if (param->status_cb.heartbeat_pub_status.status ==
                        ESP_BLE_MESH_CFG_STATUS_SUCCESS) {
                        ESP_LOGI(TAG, "Heartbeat publication set successfully");
                    } else {
                        ESP_LOGE(TAG,
                                 "Failed to set heartbeat publication, status "
                                 "code: %d",
                                 param->status_cb.heartbeat_pub_status.status);
                    }
                    char addr_str[18];
                    if (node) {
                        sprintf(addr_str, "%02X:%02X:%02X:%02X:%02X:%02X",
                                node->addr[0], node->addr[1], node->addr[2],
                                node->addr[3], node->addr[4], node->addr[5]);
                    }
                    send_node_state_to_cloud(
                        addr_str,
                        param->status_cb.heartbeat_pub_status.features);
                    break;
                }
                default:
                    break;
            }
            break;
        case ESP_BLE_MESH_CFG_CLIENT_PUBLISH_EVT:
            switch (opcode) {
                case ESP_BLE_MESH_MODEL_OP_COMPOSITION_DATA_STATUS:
                    ESP_LOG_BUFFER_HEX("composition data %s",
                                       param->status_cb.comp_data_status
                                           .composition_data->data,
                                       param->status_cb.comp_data_status
                                           .composition_data->len);
                    break;
                case ESP_BLE_MESH_MODEL_OP_APP_KEY_STATUS:
                    break;
                default:
                    break;
            }
            break;
        case ESP_BLE_MESH_CFG_CLIENT_TIMEOUT_EVT:
            switch (opcode) {
                case ESP_BLE_MESH_MODEL_OP_COMPOSITION_DATA_GET: {
                    esp_ble_mesh_cfg_client_get_state_t get_state = {0};
                    example_ble_mesh_set_msg_common(
                        &common, node, config_client.model,
                        ESP_BLE_MESH_MODEL_OP_COMPOSITION_DATA_GET);
                    get_state.comp_data_get.page = COMP_DATA_PAGE_0;
                    err = esp_ble_mesh_config_client_get_state(&common,
                                                               &get_state);
                    if (err) {
                        ESP_LOGE(TAG, "%s: Config Composition Data Get failed",
                                 __func__);
                        return;
                    }
                    break;
                }
                case ESP_BLE_MESH_MODEL_OP_APP_KEY_ADD: {
                    esp_ble_mesh_cfg_client_set_state_t set_state = {0};
                    example_ble_mesh_set_msg_common(
                        &common, node, config_client.model,
                        ESP_BLE_MESH_MODEL_OP_APP_KEY_ADD);
                    set_state.app_key_add.net_idx = prov_key.net_idx;
                    set_state.app_key_add.app_idx = prov_key.app_idx;
                    memcpy(set_state.app_key_add.app_key, prov_key.app_key, 16);
                    err = esp_ble_mesh_config_client_set_state(&common,
                                                               &set_state);
                    if (err) {
                        ESP_LOGE(TAG, "%s: Config AppKey Add failed", __func__);
                        return;
                    }
                    break;
                }
                case ESP_BLE_MESH_MODEL_OP_MODEL_APP_BIND: {
                    esp_ble_mesh_cfg_client_set_state_t set_state = {0};
                    if (wait_model_id == ESP_BLE_MESH_MODEL_ID_SENSOR_SRV &&
                        wait_cid == ESP_BLE_MESH_CID_NVAL) {
                        example_ble_mesh_set_msg_common(
                            &common, node, config_client.model,
                            ESP_BLE_MESH_MODEL_OP_MODEL_APP_BIND);
                        set_state.model_app_bind.element_addr =
                            node->unicast_addr;
                        set_state.model_app_bind.model_app_idx =
                            prov_key.app_idx;
                        set_state.model_app_bind.model_id = wait_model_id;
                        set_state.model_app_bind.company_id = wait_cid;
                        err = esp_ble_mesh_config_client_set_state(&common,
                                                                   &set_state);
                        if (err != ESP_OK) {
                            ESP_LOGE(TAG,
                                     "%s: Config Model App Bind (Sensor "
                                     "Server) failed ",
                                     __func__);
                            return;
                        }
                    } else {
                        example_ble_mesh_set_msg_common(
                            &common, node, config_client.model,
                            ESP_BLE_MESH_MODEL_OP_MODEL_APP_BIND);
                        set_state.model_app_bind.element_addr =
                            node->unicast_addr;
                        set_state.model_app_bind.model_app_idx =
                            prov_key.app_idx;
                        set_state.model_app_bind.model_id =
                            ESP_BLE_MESH_MODEL_ID_GEN_ONOFF_SRV;
                        set_state.model_app_bind.company_id =
                            ESP_BLE_MESH_CID_NVAL;
                        err = esp_ble_mesh_config_client_set_state(&common,
                                                                   &set_state);
                        if (err) {
                            ESP_LOGE(TAG,
                                     "%s: Config Model App Bind (OnOff Server) "
                                     "failed",
                                     __func__);
                            return;
                        }
                    }
                    break;
                }
                case ESP_BLE_MESH_MODEL_OP_HEARTBEAT_PUB_SET: {
                    if (param->status_cb.heartbeat_pub_status.status ==
                        ESP_BLE_MESH_CFG_STATUS_SUCCESS) {
                        ESP_LOGI(TAG, "Heartbeat publication set successfully");
                    } else {
                        ESP_LOGE(TAG,
                                 "Failed to set heartbeat publication, status "
                                 "code: %d",
                                 param->status_cb.heartbeat_pub_status.status);
                    }
                    char addr_str[18];
                    if (node) {
                        sprintf(addr_str, "%02X:%02X:%02X:%02X:%02X:%02X",
                                node->addr[0], node->addr[1], node->addr[2],
                                node->addr[3], node->addr[4], node->addr[5]);
                    }
                    send_node_state_to_cloud(
                        addr_str,
                        param->status_cb.heartbeat_pub_status.features);
                    break;
                }
                default:
                    break;
            }
            break;
        default:
            ESP_LOGE(TAG, "Not a config client status message event");
            break;
    }
}

static void example_ble_mesh_generic_client_cb(
    esp_ble_mesh_generic_client_cb_event_t event,
    esp_ble_mesh_generic_client_cb_param_t *param) {
    esp_ble_mesh_client_common_param_t common = {0};
    esp_ble_mesh_node_t *node = NULL;
    uint32_t opcode;
    uint16_t addr;
    int err;

    opcode = param->params->opcode;
    addr = param->params->ctx.addr;

