xd3011/ESP32-Provisioner-BLE-Mesh/main/main.c
    ESP_LOGI(TAG,
             "%s, error_code = 0x%02x, event = 0x%02x, addr: 0x%04x, opcode: "
             "0x%04" PRIx32,
             __func__, param->error_code, event, param->params->ctx.addr,
             opcode);

    if (param->error_code) {
        ESP_LOGE(TAG, "Send generic client message failed, opcode 0x%04" PRIx32,
                 opcode);
        return;
    }
    node = esp_ble_mesh_provisioner_get_node_with_addr(addr);
    if (!node) {
        ESP_LOGE(TAG, "%s: Get node info failed", __func__);
        return;
    }

    switch (event) {
        case ESP_BLE_MESH_GENERIC_CLIENT_GET_STATE_EVT:
            switch (opcode) {
                case ESP_BLE_MESH_MODEL_OP_GEN_ONOFF_GET: {
                    esp_ble_mesh_generic_client_set_state_t set_state = {0};
                    uint8_t state_onoff =
                        param->status_cb.onoff_status.present_onoff;
                    ESP_LOGI(
                        TAG,
                        "ESP_BLE_MESH_MODEL_OP_GEN_ONOFF_GET onoff: 0x%02x",
                        state_onoff);
                    /* After Generic OnOff Status for Generic OnOff Get is
                     * received, Generic OnOff Set will be sent */
                    example_ble_mesh_set_msg_common(
                        &common, node, onoff_client.model,
                        ESP_BLE_MESH_MODEL_OP_GEN_ONOFF_SET);
                    set_state.onoff_set.op_en = false;
                    set_state.onoff_set.onoff = !state_onoff;
                    set_state.onoff_set.tid = 0;
                    err = esp_ble_mesh_generic_client_set_state(&common,
                                                                &set_state);
                    if (err) {
                        ESP_LOGE(TAG, "%s: Generic OnOff Set failed", __func__);
                        return;
                    }
                    break;
                }
                default:
                    break;
            }
            break;
        case ESP_BLE_MESH_GENERIC_CLIENT_SET_STATE_EVT:
            switch (opcode) {
                case ESP_BLE_MESH_MODEL_OP_GEN_ONOFF_SET:
                    uint8_t state_onoff =
                        param->status_cb.onoff_status.present_onoff;
                    ESP_LOGI(
                        TAG,
                        "ESP_BLE_MESH_MODEL_OP_GEN_ONOFF_SET onoff: 0x%02x",
                        state_onoff);
                    break;
                default:
                    break;
            }
            break;
        case ESP_BLE_MESH_GENERIC_CLIENT_PUBLISH_EVT:
            switch (opcode) {
                case ESP_BLE_MESH_MODEL_OP_GEN_ONOFF_STATUS:
                    ESP_LOGI(TAG,
                             "ESP_BLE_MESH_MODEL_OP_GEN_ONOFF_STATUS. onoff: "
                             "0x%02x, target_onoff: 0x%02x, remain_time: "
                             "0x%02x, op_en: %d",
                             param->status_cb.onoff_status.present_onoff,
                             param->status_cb.onoff_status.target_onoff,
                             param->status_cb.onoff_status.remain_time,
                             param->status_cb.onoff_status.op_en);
                    break;
                default:
                    break;
            }
            break;
        case ESP_BLE_MESH_GENERIC_CLIENT_TIMEOUT_EVT:
            /* If failed to receive the responses, these messages will be resend
             */
            switch (opcode) {
                case ESP_BLE_MESH_MODEL_OP_GEN_ONOFF_GET: {
                    esp_ble_mesh_generic_client_get_state_t get_state = {0};
                    example_ble_mesh_set_msg_common(
                        &common, node, onoff_client.model,
                        ESP_BLE_MESH_MODEL_OP_GEN_ONOFF_GET);
                    err = esp_ble_mesh_generic_client_get_state(&common,
                                                                &get_state);
                    if (err) {
                        ESP_LOGE(TAG, "%s: Generic OnOff Get failed", __func__);
                        return;
                    }
                    break;
                }
                case ESP_BLE_MESH_MODEL_OP_GEN_ONOFF_SET: {
                    esp_ble_mesh_generic_client_set_state_t set_state = {0};
                    uint8_t state_onoff =
                        param->status_cb.onoff_status.present_onoff;
                    ESP_LOGI(
                        TAG,
                        "ESP_BLE_MESH_MODEL_OP_GEN_ONOFF_GET onoff: 0x%02x",
                        state_onoff);
                    example_ble_mesh_set_msg_common(
                        &common, node, onoff_client.model,
                        ESP_BLE_MESH_MODEL_OP_GEN_ONOFF_SET);
                    set_state.onoff_set.op_en = false;
                    set_state.onoff_set.onoff = !state_onoff;
                    set_state.onoff_set.tid = 0;
                    err = esp_ble_mesh_generic_client_set_state(&common,
                                                                &set_state);
                    if (err) {
                        ESP_LOGE(TAG, "%s: Generic OnOff Set failed", __func__);
                        return;
                    }
                    break;
                }
                default:
                    break;
            }
            break;
        default:
            ESP_LOGE(TAG, "Not a generic client status message event");
            break;
    }
}

// void example_ble_mesh_send_sensor_message(uint32_t opcode)
// {
//     esp_ble_mesh_sensor_client_get_state_t get = {0};
//     esp_ble_mesh_client_common_param_t common = {0};
//     esp_ble_mesh_node_t *node = NULL;
//     esp_err_t err = ESP_OK;

//     node = esp_ble_mesh_provisioner_get_node_with_addr(server_address);
//     if (node == NULL) {
//         ESP_LOGE(TAG, "Node 0x%04x not exists", server_address);
//         return;
//     }

//     example_ble_mesh_set_msg_common(&common, node, sensor_client.model,
//     opcode); switch (opcode) { case ESP_BLE_MESH_MODEL_OP_SENSOR_CADENCE_GET:
//         get.cadence_get.property_id = sensor_prop_id;
//         break;
//     case ESP_BLE_MESH_MODEL_OP_SENSOR_SETTINGS_GET:
//         get.settings_get.sensor_property_id = sensor_prop_id;
//         break;
//     case ESP_BLE_MESH_MODEL_OP_SENSOR_SERIES_GET:
//         get.series_get.property_id = sensor_prop_id;
//         break;
//     default:
//         break;
//     }

//     err = esp_ble_mesh_sensor_client_get_state(&common, &get);
//     if (err != ESP_OK) {
//         ESP_LOGE(TAG, "Failed to send sensor message 0x%04" PRIx32, opcode);
//     }
// }

// static void example_ble_mesh_sensor_timeout(uint32_t opcode)
// {
//     switch (opcode) {
//     case ESP_BLE_MESH_MODEL_OP_SENSOR_DESCRIPTOR_GET:
//         ESP_LOGW(TAG, "Sensor Descriptor Get timeout, opcode 0x%04" PRIx32,
//         opcode); break;
//     case ESP_BLE_MESH_MODEL_OP_SENSOR_CADENCE_GET:
//         ESP_LOGW(TAG, "Sensor Cadence Get timeout, opcode 0x%04" PRIx32,
//         opcode); break;
//     case ESP_BLE_MESH_MODEL_OP_SENSOR_CADENCE_SET:
//         ESP_LOGW(TAG, "Sensor Cadence Set timeout, opcode 0x%04" PRIx32,
//         opcode); break;
//     case ESP_BLE_MESH_MODEL_OP_SENSOR_SETTINGS_GET:
//         ESP_LOGW(TAG, "Sensor Settings Get timeout, opcode 0x%04" PRIx32,
//         opcode); break;
//     case ESP_BLE_MESH_MODEL_OP_SENSOR_SETTING_GET:
//         ESP_LOGW(TAG, "Sensor Setting Get timeout, opcode 0x%04" PRIx32,
//         opcode); break;
//     case ESP_BLE_MESH_MODEL_OP_SENSOR_SETTING_SET:
//         ESP_LOGW(TAG, "Sensor Setting Set timeout, opcode 0x%04" PRIx32,
//         opcode); break;
//     case ESP_BLE_MESH_MODEL_OP_SENSOR_GET:
//         ESP_LOGW(TAG, "Sensor Get timeout, 0x%04" PRIx32, opcode);
//         break;
//     case ESP_BLE_MESH_MODEL_OP_SENSOR_COLUMN_GET:
//         ESP_LOGW(TAG, "Sensor Column Get timeout, opcode 0x%04" PRIx32,
//         opcode); break;
//     case ESP_BLE_MESH_MODEL_OP_SENSOR_SERIES_GET:
//         ESP_LOGW(TAG, "Sensor Series Get timeout, opcode 0x%04" PRIx32,
//         opcode); break;
//     default:
//         ESP_LOGE(TAG, "Unknown Sensor Get/Set opcode 0x%04" PRIx32, opcode);
//         return;
//     }

//     example_ble_mesh_send_sensor_message(opcode);
// }

static void example_ble_mesh_sensor_client_cb(
    esp_ble_mesh_sensor_client_cb_event_t event,
    esp_ble_mesh_sensor_client_cb_param_t *param) {
    esp_ble_mesh_node_t *node = NULL;

    ESP_LOGI(TAG, "Sensor client, event %u, addr 0x%04x", event,
             param->params->ctx.addr);

    if (param->error_code) {
        ESP_LOGE(TAG, "Send sensor client message failed (err %d)",
                 param->error_code);
        return;
    }

    node = esp_ble_mesh_provisioner_get_node_with_addr(param->params->ctx.addr);
    if (!node) {
        ESP_LOGE(TAG, "Node 0x%04x not exists", param->params->ctx.addr);
        return;
    }

