xd3011/ESP32-Provisioner-BLE-Mesh/main/main.c
static esp_err_t ble_mesh_init(void) {
    // uint8_t match[2] = {0xdd, 0xdd};
    // uint8_t match;

    esp_err_t err = ESP_OK;

    prov_key.net_idx = ESP_BLE_MESH_KEY_PRIMARY;
    prov_key.app_idx = APP_KEY_IDX;
    memset(prov_key.app_key, APP_KEY_OCTET, sizeof(prov_key.app_key));

    esp_ble_mesh_register_prov_callback(example_ble_mesh_provisioning_cb);
    esp_ble_mesh_register_config_client_callback(
        example_ble_mesh_config_client_cb);
    esp_ble_mesh_register_generic_client_callback(
        example_ble_mesh_generic_client_cb);
    esp_ble_mesh_register_sensor_client_callback(
        example_ble_mesh_sensor_client_cb);

    err = esp_ble_mesh_init(&provision, &composition);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to initialize mesh stack (err %d)", err);
        return err;
    }

    // err = esp_ble_mesh_provisioner_set_dev_uuid_match(match, sizeof(match),
    // 0x0,
    //                                                   false);
    // if (err != ESP_OK) {
    //     ESP_LOGE(TAG, "Failed to set matching device uuid (err %d)", err);
    //     return err;
    // }
    err = esp_ble_mesh_provisioner_prov_enable(
        (esp_ble_mesh_prov_bearer_t)(ESP_BLE_MESH_PROV_ADV |
                                     ESP_BLE_MESH_PROV_GATT));
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to enable mesh provisioner (err %d)", err);
        return err;
    }

    err = esp_ble_mesh_provisioner_add_local_app_key(
        prov_key.app_key, prov_key.net_idx, prov_key.app_idx);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to add local AppKey (err %d)", err);
        return err;
    }

    err = esp_ble_mesh_model_subscribe_group_addr(
        PROV_OWN_ADDR, ESP_BLE_MESH_CID_NVAL,
        ESP_BLE_MESH_MODEL_ID_GEN_ONOFF_CLI, 0xC000);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to subscribe to group address 0xC000");
        return err;
    }

    ESP_LOGI(TAG, "Successfully subscribed to group address 0xC000");

    ESP_LOGI(TAG, "BLE Mesh Provisioner initialized");

    return err;
}

static void event_handler(void *arg, esp_event_base_t event_base,
                          int32_t event_id, void *event_data) {
    if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_START) {
        esp_wifi_connect();
    } else if (event_base == WIFI_EVENT &&
               event_id == WIFI_EVENT_STA_DISCONNECTED) {
        if (s_retry_num < EXAMPLE_ESP_MAXIMUM_RETRY) {
            esp_wifi_connect();
            s_retry_num++;
            ESP_LOGI(TAG, "retry to connect to the AP");
        } else {
            xEventGroupSetBits(s_wifi_event_group, WIFI_FAIL_BIT);
        }
        ESP_LOGI(TAG, "connect to the AP fail");
    } else if (event_base == IP_EVENT && event_id == IP_EVENT_STA_GOT_IP) {
        ip_event_got_ip_t *event = (ip_event_got_ip_t *)event_data;
        ESP_LOGI(TAG, "got ip:" IPSTR, IP2STR(&event->ip_info.ip));
        s_retry_num = 0;
        xEventGroupSetBits(s_wifi_event_group, WIFI_CONNECTED_BIT);
    }
}

void wifi_init_sta(void) {
    s_wifi_event_group = xEventGroupCreate();

    ESP_ERROR_CHECK(esp_netif_init());

    ESP_ERROR_CHECK(esp_event_loop_create_default());
    esp_netif_create_default_wifi_sta();

    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_wifi_init(&cfg));

    esp_event_handler_instance_t instance_any_id;
    esp_event_handler_instance_t instance_got_ip;
    ESP_ERROR_CHECK(esp_event_handler_instance_register(
        WIFI_EVENT, ESP_EVENT_ANY_ID, &event_handler, NULL, &instance_any_id));
    ESP_ERROR_CHECK(esp_event_handler_instance_register(
        IP_EVENT, IP_EVENT_STA_GOT_IP, &event_handler, NULL, &instance_got_ip));

    char ssid[32] = {0};
    char password[64] = {0};
    strncpy(ssid, wifi_ssid, sizeof(ssid) - 1);
    strncpy(password, wifi_pass, sizeof(password) - 1);

    wifi_config_t wifi_config = {
        .sta =
            {
                .ssid = EXAMPLE_ESP_WIFI_SSID,
                .password = EXAMPLE_ESP_WIFI_PASS,
                /* Authmode threshold resets to WPA2 as default if password
                 * matches WPA2 standards (pasword len => 8). If you want to
                 * connect the device to deprecated WEP/WPA networks, Please set
                 * the threshold value to WIFI_AUTH_WEP/WIFI_AUTH_WPA_PSK and
                 * set the password with length and format matching to
                 * WIFI_AUTH_WEP/WIFI_AUTH_WPA_PSK standards.
                 */
                .threshold.authmode = ESP_WIFI_SCAN_AUTH_MODE_THRESHOLD,
                .sae_pwe_h2e = WPA3_SAE_PWE_BOTH,
            },
    };

    memcpy(wifi_config.sta.ssid, ssid, sizeof(ssid));
    memcpy(wifi_config.sta.password, password, sizeof(password));

    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
    ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_STA, &wifi_config));
    ESP_ERROR_CHECK(esp_wifi_start());

    ESP_LOGI(TAG, "wifi_init_sta finished.");

    /* Waiting until either the connection is established (WIFI_CONNECTED_BIT)
     * or connection failed for the maximum number of re-tries (WIFI_FAIL_BIT).
     * The bits are set by event_handler() (see above) */
    EventBits_t bits = xEventGroupWaitBits(s_wifi_event_group,
                                           WIFI_CONNECTED_BIT | WIFI_FAIL_BIT,
                                           pdFALSE, pdFALSE, portMAX_DELAY);

    /* xEventGroupWaitBits() returns the bits before the call returned, hence we
     * can test which event actually happened. */
    if (bits & WIFI_CONNECTED_BIT) {
        ESP_LOGI(TAG, "connected to ap SSID:%s password:%s",
                 EXAMPLE_ESP_WIFI_SSID, EXAMPLE_ESP_WIFI_PASS);
        mqtt_app_start();
    } else if (bits & WIFI_FAIL_BIT) {
        ESP_LOGI(TAG, "Failed to connect to SSID:%s, password:%s",
                 EXAMPLE_ESP_WIFI_SSID, EXAMPLE_ESP_WIFI_PASS);
    } else {
        ESP_LOGE(TAG, "UNEXPECTED EVENT");
    }
}

void mqtt_data_callback(uint8_t *data, uint16_t lenght) {
    // {"action":1,"addr":"0x0008","state":0}
    uint16_t action = 0;
    // Parse JSON
    cJSON *root = cJSON_Parse((char *)data);
    if (root == NULL) {
        ESP_LOGE(TAG, "Failed to parse JSON");
        return;
    }

    // Get action
    cJSON *action_item = cJSON_GetObjectItem(root, "action");
    if (action_item != NULL && cJSON_IsNumber(action_item)) {
        action = (uint16_t)action_item->valueint;
    }
    printf("action: %d\n", action);

    switch (action) {
        case MQTT_ACTION_ENABLE_PROVISIONER:
            enable_provisioner = 1;
            break;
        case MQTT_ACTION_DISENABLE_PROVISIONER:
            enable_provisioner = 0;
            reset_devices();
            break;
        case MQTT_ACTION_PROVISION:
            uint8_t dev_uuid[16] = {0};
            // Get dev_uuid
            cJSON *dev_uuid_item = cJSON_GetObjectItem(root, "dev_uuid");
            if (dev_uuid_item != NULL && cJSON_IsString(dev_uuid_item)) {
                char *dev_uuid_str = dev_uuid_item->valuestring;
                for (int i = 0; i < 16; i++) {
                    sscanf(dev_uuid_str + 2 * i, "%2x",
                           (unsigned int *)&dev_uuid[i]);
                }
            }
            uint8_t addr[BD_ADDR_LEN] = {0};
            // Get addr
            cJSON *addr_item = cJSON_GetObjectItem(root, "addr");
            if (addr_item != NULL && cJSON_IsString(addr_item)) {
                char *addr_str = addr_item->valuestring;
                for (int i = 0; i < BD_ADDR_LEN; i++) {
                    sscanf(addr_str + 3 * i, "%2hhx", &addr[i]);
                }
            }
            esp_ble_mesh_addr_type_t addr_type = 0;
            // Get addr_type
            cJSON *addr_type_item = cJSON_GetObjectItem(root, "addr_type");
            if (addr_type_item != NULL && cJSON_IsNumber(addr_type_item)) {
                addr_type = (esp_ble_mesh_addr_type_t)addr_type_item->valueint;
            }
            uint16_t oob_info = 0;
            // Get oob_info
            cJSON *oob_info_item = cJSON_GetObjectItem(root, "oob_info");
            if (oob_info_item != NULL && cJSON_IsNumber(oob_info_item)) {
                oob_info = (uint16_t)oob_info_item->valueint;
            }
            esp_ble_mesh_prov_bearer_t bearer = 0;
            // Get bearer
            cJSON *bearer_item = cJSON_GetObjectItem(root, "bearer");
            if (bearer_item != NULL && cJSON_IsNumber(bearer_item)) {
                bearer = (esp_ble_mesh_prov_bearer_t)bearer_item->valueint;
            }

            cJSON *type_item = cJSON_GetObjectItem(root, "type");
            if (type_item != NULL && cJSON_IsString(type_item)) {
                model_setup = malloc(strlen(type_item->valuestring) + 1);
                if (model_setup != NULL) {
                    strcpy(model_setup, type_item->valuestring);
                } else {
                    printf("Memory allocation failed\n");
                }
            }

