xd3011/ESP32-Provisioner-BLE-Mesh/main/main.c
    if (strlen(AP_PASS) == 0) {
        ap_config.ap.authmode = WIFI_AUTH_OPEN;
    }

    err = esp_wifi_set_mode(WIFI_MODE_AP);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to set WiFi mode to AP: %s",
                 esp_err_to_name(err));
        return;
    }

    err = esp_wifi_set_config(ESP_IF_WIFI_AP, &ap_config);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to set WiFi AP config: %s", esp_err_to_name(err));
        return;
    }

    // Khởi động WiFi ở chế độ AP
    err = esp_wifi_start();
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to start WiFi in AP mode: %s",
                 esp_err_to_name(err));
    } else {
        ESP_LOGI(TAG, "WiFi started in AP mode with SSID %s", AP_SSID);
    }
    ESP_ERROR_CHECK(esp_netif_init());
    err = esp_event_handler_register(IP_EVENT, IP_EVENT_AP_STAIPASSIGNED,
                                     &connect_handler, &server);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to register IP_EVENT handler: %s",
                 esp_err_to_name(err));
    }
}

void get_data_nvs() {
    nvs_handle_t my_handle;
    esp_err_t err;
    err = nvs_open("config", NVS_READWRITE, &my_handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Error (%s) opening NVS handle!", esp_err_to_name(err));
    } else {
        size_t ssid_len = 32;
        char ssid[32];
        err = nvs_get_str(my_handle, "ssid", ssid, &ssid_len);
        if (err != ESP_OK) {
            ESP_LOGE(TAG, "Error (%s) reading SSID from NVS!",
                     esp_err_to_name(err));
        } else {
            strncpy(wifi_ssid, ssid, sizeof(wifi_ssid) - 1);
            wifi_ssid[sizeof(wifi_ssid) - 1] = '\0';
        }

        size_t password_len = 64;
        char password[64];
        err = nvs_get_str(my_handle, "password", password, &password_len);
        if (err != ESP_OK) {
            ESP_LOGE(TAG, "Error (%s) reading password from NVS!",
                     esp_err_to_name(err));
        } else {
            strncpy(wifi_pass, password, sizeof(wifi_pass) - 1);
            wifi_pass[sizeof(wifi_pass) - 1] = '\0';
        }

        nvs_close(my_handle);
    }
}

void app_main(void) {
    esp_err_t err;

    ESP_LOGI(TAG, "Initializing...");

    err = nvs_flash_init();
    if (err == ESP_ERR_NVS_NO_FREE_PAGES) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        err = nvs_flash_init();
    }
    ESP_ERROR_CHECK(err);

    get_data_nvs();

    err = bluetooth_init();
    if (err) {
        ESP_LOGE(TAG, "esp32_bluetooth_init failed (err %d)", err);
        return;
    }

    ble_mesh_get_dev_uuid(dev_uuid);

    /* Initialize the Bluetooth Mesh Subsystem */
    err = ble_mesh_init();
    if (err) {
        ESP_LOGE(TAG, "Bluetooth mesh init failed (err %d)", err);
    }
    board_init();
    mqtt_data_pt_set_callback(mqtt_data_callback);
    wifi_init_sta();
    xTaskCreate(send_heartbeat_to_all_nodes_task, "SendHeartbeatTask", 2048,
                NULL, 5, &heartbeatTaskHandle);
}